UZ-REPOS/SPA/PROD-ACTUAL/SPA.SA/Dictionaries/GT/Commands/AddGatesm.xml

<?xml version="1.0" encoding="UTF-8"?>
<Command Name="AddGatesm" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="Command.xsd">
	<Description>Добавление на GATE'</Description>
	<Author Name="Vladimir Khovanskiy" Date="2009-04-26+11:09"/>
	<Request Template='&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;TestMethod xmlns="http://sitronicsts.com/MessagingGateway"&gt;
      &lt;Methodname&gt;SENDCONTENT&lt;/Methodname&gt;
      &lt;StringOfParams&gt;customer={0};content=efewff&lt;/StringOfParams&gt;
    &lt;/TestMethod&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;'>
		<Item Name="msisdn" Type="Wellknown"/>
	</Request>
	<ErrorsList CodePage="ASCII">
		<Error Name="-3" Value="SUCCESS"/>
	</ErrorsList>
</Command>