UZ-REPOS/SPA/PROD-2018.09.06/SPA.SA/Dictionaries/GT/Commands/BreakSessionInformator.xml

<?xml version="1.0" encoding="UTF-8"?>
<Command Name="BreakSessionInformator" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="Command.xsd">
	<Description>'Информирование о разрыве сессии'</Description>
	<Author Name="Timur Khamzin" Date="2015-02-13+11:09"/>
	<Request Template='&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;TestMethod xmlns="http://sitronicsts.com/MessagingGateway"&gt;
      &lt;Methodname&gt;GetInfo&lt;/Methodname&gt;
      &lt;StringOfParams&gt;sender=111;recipient={0};message={1}&lt;/StringOfParams&gt;
    &lt;/TestMethod&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;'>
		<Item Name="msisdn" Type="Wellknown"/>
                <Item Name="message" Type="Parameter"/>
	</Request>
	<ErrorsList CodePage="ASCII">
		<Error Name="-3" Value="SUCCESS"/>
	</ErrorsList>
</Command>